In [1]:
import pandas as pd
import numpy as np

In [3]:
obje = pd.Series(np.arange(5), index=["a","b","c","d","e"])
obje

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [4]:
obje["c"] #değeri index ismini girerek bulabiliriz.

2

In [6]:
obje[2] #yukardaki işlemi index numarasını girerekte yapabiliriz.

2

In [7]:
obje[0:3]

a    0
b    1
c    2
dtype: int32

In [9]:
obje[["a","c"]]#belirli bir satır almak istersek

a    0
c    2
dtype: int32

In [11]:
obje [[0,2]] #index numarası girerekte yapabiliriz.

a    0
c    2
dtype: int32

In [12]:
obje[obje<2] #2 den küçük değerleri ekrana yazdırmak için

a    0
b    1
dtype: int32

In [13]:
obje["a":"c"] # a dan c ye kadar olanlar yazar.

a    0
b    1
c    2
dtype: int32

In [14]:
#dilimlenen kısma değer ataması yapabiliriz.
obje["b":"c"] = 5 #b den c ye kadar 5 değeri atandı.
obje

a    0
b    5
c    5
d    3
e    4
dtype: int32

In [16]:
#veriyi oluştururken arange ve reshape methodlarını kullanıyoruz. Bu veririn değerlerinide bursa ... gibi atıyoruz sonra columns ile sutünları değiştiriyoruz index ile de indexleri değiştiriyoruz
veri = pd.DataFrame(np.arange(16).reshape(4,4),index = ["Bursa","Ankara","Rize","Istanbul"],columns = ["bir","iki","üç","dört"])
veri

          bir  iki  üç  dört
Bursa       0    1   2     3
Ankara      4    5   6     7
Rize        8    9  10    11
Istanbul   12   13  14    15

In [17]:
veri["iki"]

Bursa        1
Ankara       5
Rize         9
Istanbul    13
Name: iki, dtype: int32

In [18]:
veri[["bir","iki"]]#birden çok sutün için liste içinde liste yapısını kullandık.

          bir  iki
Bursa       0    1
Ankara      4    5
Rize        8    9
Istanbul   12   13

In [19]:
veri[:3]

        bir  iki  üç  dört
Bursa     0    1   2     3
Ankara    4    5   6     7
Rize      8    9  10    11

In [22]:
veri[veri["dört"]>5] #dortuncu sutundaki 5'den büyük değerleri ekrana yazdı.

          bir  iki  üç  dört
Ankara      4    5   6     7
Rize        8    9  10    11
Istanbul   12   13  14    15

In [24]:
veri[veri<5]= 0
veri #5 den küçük değerlere 0 değeri atandı.

          bir  iki  üç  dört
Bursa       0    0   0     0
Ankara      0    5   6     7
Rize        8    9  10    11
Istanbul   12   13  14    15

In [25]:
#iloc İÇİN NUMARALAR KULLANILIR,
#loc İÇİN ETİKETLER KULLNAILIR.

veri.iloc[1] #1. indekse sahip satırın değerleri için

bir     0
iki     5
üç      6
dört    7
Name: Ankara, dtype: int32

In [26]:
veri.iloc[1,[1,2,3]] #1. indekse sahip satırın 1.2.ve 3.sutünlarının değerlerini yazdırır.

iki     5
üç      6
dört    7
Name: Ankara, dtype: int32

In [27]:
veri.iloc[[1,3],[1,2,3]] #istediğimiz satırların istediğimiz sutunlarına ulaşabiliriz.

          iki  üç  dört
Ankara      5   6     7
Istanbul   13  14    15

In [28]:
veri.loc["Rize",["bir","iki"]] #bir satırın birden çok sutununu seçmek istersek.

bir    8
iki    9
Name: Rize, dtype: int32

In [29]:
veri.loc[:"Rize","dört"] #rizeye kadar olan satırların dörduncu sutun değerleri ekrana yazıldı.

Bursa      0
Ankara     7
Rize      11
Name: dört, dtype: int32

In [31]:
veri = pd.Series(np.arange(5),index = ["a","b","c","d","e"])
veri

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [35]:
veri[-1] #indexleri etiketlemeden -1 . satırı istersek error alırız. etiketlememiz lazım.

4